BEST Practices to Manipulate elements in a Data Frame

In [1]:
import pandas as pd
t=pd.read_csv('titanic.csv')

Changing a single value

In [2]:
t.loc[2,'age']=27
t.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  27.0      0      0   7.9250        S  NaN

In [3]:
t.iloc[1,0]=0
t.head(2)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         0       1  female  38.0      1      0  71.2833        C    C

Changing Multiple Values

In [4]:
t.loc[[4,6,8],['survived']]=[1,1,1]
t.head(9)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         0       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  27.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         1       3    male  35.0      0      0   8.0500        S  NaN
5         0       3    male   NaN      0      0   8.4583        Q  NaN
6         1       1    male  54.0      0      0  51.8625        S    E
7         0       3    male   2.0      3      1  21.0750        S  NaN
8         1       3  female  27.0      0      2  11.1333        S  NaN

In [5]:
#The above can also be done using iloc

In [6]:
l=list(t.loc[t.age<=1].index)#Creating a list of index's of babies(age<1)
l

[78, 164, 172, 183, 305, 381, 386, 469, 644, 755, 788, 803, 827, 831]

In [7]:
t.loc[l,'age']=1
t.iloc[l,::]#Therefore values Have been rounded

     survived  pclass     sex  age  sibsp  parch      fare embarked deck
78          1       2    male  1.0      0      2   29.0000        S  NaN
164         0       3    male  1.0      4      1   39.6875        S  NaN
172         1       3  female  1.0      1      1   11.1333        S  NaN
183         1       2    male  1.0      2      1   39.0000        S    F
305         1       1    male  1.0      1      2  151.5500        S    C
381         1       3  female  1.0      0      2   15.7417        C  NaN
386         0       3    male  1.0      5      2   46.9000        S  NaN
469         1       3  female  1.0      2      1   19.2583        C  NaN
644         1       3  female  1.0      2      1   19.2583        C  NaN
755         1       2    male  1.0      1      1   14.5000        S  NaN
788         1       3    male  1.0      1      2   20.5750        S  NaN
803         1       3    male  1.0      0      1    8.5167        C  NaN
827         1       2    male  1.0      0      2   37.0042        C  NaN
831         1       2    male  1.0      1      1   18.7500        S  NaN

In [8]:
t.iloc[4,0:3]=[1,1,'male']#Changing values in a row

In [9]:
t.replace(0,'zero').head(2)

  survived  pclass     sex   age sibsp parch     fare embarked deck
0     zero       3    male  22.0     1  zero     7.25        S  NaN
1     zero       1  female  38.0     1  zero  71.2833        C    C

In [10]:
t.replace(t.loc[2,'sex'],'male').head(2)#Hence value of row changes

   survived  pclass   sex   age  sibsp  parch     fare embarked deck
0         0       3  male  22.0      1      0   7.2500        S  NaN
1         0       1  male  38.0      1      0  71.2833        C    C

Views and Copy's
If its a view, a change on the slice will reflect in the orginal data frame.

In [11]:
age=t.loc[::,'age']
age._is_view

True

In [12]:
age.iloc[1:4]=4#Hence warning comes of value being changed in orginal data frame

C:\Users\Haider\Desktop\New folder\lib\site-packages\pandas\core\indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [13]:
x=t.loc[t.age<1]
x._is_view#Fence the following is a copy, won't reflect in the data frame

False

Two Methods to perform definite and practical manipulation

1) To Change Values in a Data Frame-
avoid chained indexing

In [24]:
t.loc[8,'age']=10#directly changing value in data frame

2) Avoid Changing Values in a data frame,but only operate with a slice of data frame

In [26]:
age=t.age.copy()

In [29]:
age.iloc[2]=1#Changing value only in Series